cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70N19B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AES</name>
         <version>6149W</version>
         <description>Advanced Encryption Standard</description>
         <groupName>AES</groupName>
         <prependToName>AES_</prependToName>
         <baseAddress>0x4006C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xAC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AES</name>
            <value>56</value>
         </interrupt>
         <registers>
            <register>
               <name>AES_CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Start Processing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOADSEED</name>
                     <description>Random Number Generator Seed Loading</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CIPHER</name>
                     <description>Processing Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GTAGEN</name>
                     <description>GCM Automatic Tag Generation Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUALBUFF</name>
                     <description>Dual Input Buffer</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DUALBUFFSelect</name>
                        <enumeratedValue>
                           <name>INACTIVE</name>
                           <description>AES_IDATARx cannot be written during processing of previous block.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PROCDLY</name>
                     <description>Processing Delay</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SMOD</name>
                     <description>Start Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SMODSelect</name>
                        <enumeratedValue>
                           <name>MANUAL_START</name>
                           <description>Manual Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_START</name>
                           <description>Auto Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDATAR0_START</name>
                           <description>AES_IDATAR0 access only Auto Mode (DMA)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYSIZE</name>
                     <description>Key Size</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>KEYSIZESelect</name>
                        <enumeratedValue>
                           <name>AES128</name>
                           <description>AES Key Size is 128 bits</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AES192</name>
                           <description>AES Key Size is 192 bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AES256</name>
                           <description>AES Key Size is 256 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPMOD</name>
                     <description>Operating Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OPMODSelect</name>
                        <enumeratedValue>
                           <name>ECB</name>
                           <description>ECB: Electronic Code Book mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBC</name>
                           <description>CBC: Cipher Block Chaining mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFB</name>
                           <description>OFB: Output Feedback mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CFB</name>
                           <description>CFB: Cipher Feedback mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTR</name>
                           <description>CTR: Counter mode (16-bit internal counter)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCM</name>
                           <description>GCM: Galois/Counter mode</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOD</name>
                     <description>Last Output Data Mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFBS</name>
                     <description>Cipher Feedback Data Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CFBSSelect</name>
                        <enumeratedValue>
                           <name>SIZE_128BIT</name>
                           <description>128-bit</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIZE_64BIT</name>
                           <description>64-bit</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIZE_32BIT</name>
                           <description>32-bit</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIZE_16BIT</name>
                           <description>16-bit</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIZE_8BIT</name>
                           <description>8-bit</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKEY</name>
                     <description>Countermeasure Key</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0.</description>
                           <value>0xE</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAGRDY</name>
                     <description>GCM Tag Ready Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAGRDY</name>
                     <description>GCM Tag Ready Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TAGRDY</name>
                     <description>GCM Tag Ready Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATRDY</name>
                     <description>Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAD</name>
                     <description>Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URAT</name>
                     <description>Unspecified Register Access (cleared by writing SWRST in AES_CR)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>URATSelect</name>
                        <enumeratedValue>
                           <name>IDR_WR_PROCESSING</name>
                           <description>Input Data Register written during the data processing when SMOD = 0x2 mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ODR_RD_PROCESSING</name>
                           <description>Output Data Register read during the data processing.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MR_WR_PROCESSING</name>
                           <description>Mode Register written during the data processing.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ODR_RD_SUBKGEN</name>
                           <description>Output Data Register read during the sub-keys generation.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MR_WR_SUBKGEN</name>
                           <description>Mode Register written during the sub-keys generation.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WOR_RD_ACCESS</name>
                           <description>Write-only register read access.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TAGRDY</name>
                     <description>GCM Tag Ready</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_KEYWR[%s]</name>
               <description>Key Word Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEYW</name>
                     <description>Key Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_IDATAR[%s]</name>
               <description>Input Data Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_ODATAR[%s]</name>
               <description>Output Data Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ODATA</name>
                     <description>Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_IVR[%s]</name>
               <description>Initialization Vector Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IV</name>
                     <description>Initialization Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_AADLENR</name>
               <description>Additional Authenticated Data Length Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>AADLEN</name>
                     <description>Additional Authenticated Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_CLENR</name>
               <description>Plaintext/Ciphertext Length Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLEN</name>
                     <description>Plaintext/Ciphertext Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_GHASHR[%s]</name>
               <description>GCM Intermediate Hash Word Register</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GHASH</name>
                     <description>Intermediate GCM Hash Word x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_TAGR[%s]</name>
               <description>GCM Authentication Tag Word Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TAG</name>
                     <description>GCM Authentication Tag x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AES_CTRR</name>
               <description>GCM Encryption Counter Value Register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTR</name>
                     <description>GCM Encryption Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>AES_GCMHR[%s]</name>
               <description>GCM H Word Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>H</name>
                     <description>GCM H Word x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
